grblHAL/ESP32/main/uart_serial.c
/*

  uart_serial.c - driver code for ESP32

  Part of grblHAL

  Copyright (c) 2023-2024 Terje Io

  grblHAL is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  grblHAL is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with grblHAL. If not, see <http://www.gnu.org/licenses/>.

*/

#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#if !CONFIG_IDF_TARGET_ESP32S3
#include "esp32/rom/ets_sys.h"
#include "esp32/rom/uart.h"
#endif
#include "esp_attr.h"
#include "soc/uart_reg.h"
#include "soc/uart_struct.h"
#include "soc/io_mux_reg.h"
#include "soc/gpio_sig_map.h"
#include "soc/dport_reg.h"
#include "driver/uart.h"
#include "hal/uart_ll.h"
#include "esp_intr_alloc.h"

#include "driver.h"
#include "grbl/hal.h"
#include "grbl/protocol.h"

#define TWO_STOP_BITS_CONF 0x3
#define ONE_STOP_BITS_CONF 0x1
#define CONFIG_DISABLE_HAL_LOCKS 1

#define UART_REG_BASE(u)    ((u==0)?DR_REG_UART_BASE:(      (u==1)?DR_REG_UART1_BASE:(    (u==2)?DR_REG_UART2_BASE:0)))
#define UART_RXD_IDX(u)     ((u==0)?U0RXD_IN_IDX:(          (u==1)?U1RXD_IN_IDX:(         (u==2)?U2RXD_IN_IDX:0)))
#define UART_TXD_IDX(u)     ((u==0)?U0TXD_OUT_IDX:(         (u==1)?U1TXD_OUT_IDX:(        (u==2)?U2TXD_OUT_IDX:0)))
#define UART_INTR_SOURCE(u) ((u==0)?ETS_UART0_INTR_SOURCE:( (u==1)?ETS_UART1_INTR_SOURCE:((u==2)?ETS_UART2_INTR_SOURCE:0)))

#if CONFIG_IDF_TARGET_ESP32S3
#ifndef UART_RX_PIN
#define UART_RX_PIN 44
#endif
#ifndef UART_TX_PIN
#define UART_TX_PIN 43
#endif
#ifdef SERIAL1_PORT
#ifndef UART1_RX_PIN
#define UART1_RX_PIN 18
#endif
#ifndef UART1_TX_PIN
#define UART1_TX_PIN 17
#endif
#endif
#else // ESP32
#ifndef UART_RX_PIN
#define UART_RX_PIN 34
#endif
#ifndef UART_TX_PIN
#define UART_TX_PIN 35
#endif
#ifdef SERIAL1_PORT
#ifndef UART1_RX_PIN
#define UART1_RX_PIN 16
#endif
#ifndef UART1_TX_PIN
#define UART1_TX_PIN 17
#endif
#endif
#endif

typedef void (*uart_isr_ptr)(void *arg);

typedef struct {
#if CONFIG_IDF_TARGET_ESP32S3
   uart_dev_t *dev;
#else
   volatile uart_dev_t *dev;
#endif
#if !CONFIG_DISABLE_HAL_LOCKS
    xSemaphoreHandle lock;
#endif
    uint8_t num;
    intr_handle_t intr_handle;
    uint32_t tx_len;
} uart_t;

static int16_t serialRead (void);

#if CONFIG_DISABLE_HAL_LOCKS

#define UART_MUTEX_LOCK(u)
#define UART_MUTEX_UNLOCK(u)

static const uart_t _uart_bus_array[3] = {
    { (uart_dev_t *)(DR_REG_UART_BASE), 0, NULL, SOC_UART_FIFO_LEN },
    { (uart_dev_t *)(DR_REG_UART1_BASE), 1, NULL, SOC_UART_FIFO_LEN },
    { (uart_dev_t *)(DR_REG_UART2_BASE), 2, NULL, SOC_UART_FIFO_LEN }
};

#else

#define UART_MUTEX_LOCK(u)    do {} while (xSemaphoreTake((u)->lock, portMAX_DELAY) != pdPASS)
#define UART_MUTEX_UNLOCK(u)  xSemaphoreGive((u)->lock)

static const uart_t _uart_bus_array[3] = {
    { (uart_dev_t *)(DR_REG_UART_BASE), NULL, 0, NULL, SOC_UART_FIFO_LEN },
    { (uart_dev_t *)(DR_REG_UART1_BASE), NULL, 1, NULL, SOC_UART_FIFO_LEN },
    { (uart_dev_t *)(DR_REG_UART2_BASE), NULL, 2, NULL, SOC_UART_FIFO_LEN }
};

#endif

static const DRAM_ATTR uint16_t RX_BUFFER_SIZE_MASK = RX_BUFFER_SIZE - 1;
static const DRAM_ATTR uint32_t rx_int_flags = UART_INTR_RXFIFO_FULL|UART_INTR_RXFIFO_OVF|UART_INTR_RXFIFO_TOUT|UART_INTR_FRAM_ERR;

static uart_t uart0;
static stream_rx_buffer_t rxbuffer = {0};
static enqueue_realtime_command_ptr enqueue_realtime_command = protocol_enqueue_realtime_command;
static const io_stream_t *serialInit (uint32_t baud_rate);

#ifdef SERIAL1_PORT
static uart_t uart1;
static stream_rx_buffer_t rxbuffer1 = {0};
static enqueue_realtime_command_ptr enqueue_realtime_command2 = protocol_enqueue_realtime_command;
static const io_stream_t *serial1Init (uint32_t baud_rate);
#endif

#ifdef SERIAL2_PORT
static uart_t uart2;
static stream_rx_buffer_t rxbuffer2 = {0};
static enqueue_realtime_command_ptr enqueue_realtime_command3 = protocol_enqueue_realtime_command;
static const io_stream_t *serial2Init (uint32_t baud_rate);
#endif

static io_stream_properties_t serial[] = {
    {
      .type = StreamType_Serial,
      .instance = 0,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
      .flags.modbus_ready = On,
      .claim = serialInit
    },
#ifdef SERIAL1_PORT
    {
      .type = StreamType_Serial,
      .instance = 1,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
  #ifdef UART1_TX_PIN
      .flags.modbus_ready = On,
  #else
      .flags.rx_only = On,
  #endif
      .claim = serial1Init
    },
#endif // SERIAL1_PORT
#ifdef SERIAL2_PORT
    {
      .type = StreamType_Serial,
      .instance = 2,
      .flags.claimable = On,
      .flags.claimed = Off,
      .flags.can_set_baud = On,
  #ifdef UART2_TX_PIN
      .flags.modbus_ready = On,
  #else
      .flags.rx_only = On,
  #endif
      .claim = serial2Init
    }
#endif // SERIAL2_PORT
};

void serialRegisterStreams (void)
{
    static io_stream_details_t streams = {
        .n_streams = sizeof(serial) / sizeof(io_stream_properties_t),
        .streams = serial,
    };

    static const periph_pin_t tx0 = {
        .function = Output_TX,
        .group = PinGroup_UART,
        .pin = UART_TX_PIN,
        .mode = { .mask = PINMODE_OUTPUT },
        .description = "Primary UART"
    };

    static const periph_pin_t rx0 = {
        .function = Input_RX,
        .group = PinGroup_UART,
        .pin = UART_RX_PIN,
        .mode = { .mask = PINMODE_NONE },
        .description = "Primary UART"
    };

    hal.periph_port.register_pin(&rx0);
    hal.periph_port.register_pin(&tx0);

#ifdef SERIAL1_PORT

  #ifdef UART1_TX_PIN
    static const periph_pin_t tx1 = {
        .function = Output_TX,
        .group = PinGroup_UART2,
        .pin = UART1_TX_PIN,
        .mode = { .mask = PINMODE_OUTPUT },
        .description = "Secondary UART"
    };

